#+STARTUP: overview

* Doom mode line

#+BEGIN_SRC emacs-lisp

  ;; (use-package doom-modeline
  ;;       :ensure t
  ;;       :hook (after-init . doom-modeline-mode))

#+END_SRC

#+RESULTS:
| doom-modeline-mode | magit-auto-revert-mode--init-kludge | magit-startup-asserts | magit-version |

* Powerline

#+BEGIN_SRC emacs-lisp

  (use-package powerline)
  (powerline-default-theme)

#+END_SRC

#+RESULTS:
| %e | (:eval (let* ((active (powerline-selected-window-active)) (mode-line-buffer-id (if active (quote mode-line-buffer-id) (quote mode-line-buffer-id-inactive))) (mode-line (if active (quote mode-line) (quote mode-line-inactive))) (face0 (if active (quote powerline-active0) (quote powerline-inactive0))) (face1 (if active (quote powerline-active1) (quote powerline-inactive1))) (face2 (if active (quote powerline-active2) (quote powerline-inactive2))) (separator-left (intern (format powerline-%s-%s (powerline-current-separator) (car powerline-default-separator-dir)))) (separator-right (intern (format powerline-%s-%s (powerline-current-separator) (cdr powerline-default-separator-dir)))) (lhs (list (powerline-raw %* face0 (quote l)) (when powerline-display-buffer-size (powerline-buffer-size face0 (quote l))) (when powerline-display-mule-info (powerline-raw mode-line-mule-info face0 (quote l))) (powerline-buffer-id (` (mode-line-buffer-id (, face0))) (quote l)) (when (and (boundp (quote which-func-mode)) which-func-mode) (powerline-raw which-func-format face0 (quote l))) (powerline-raw   face0) (funcall separator-left face0 face1) (when (and (boundp (quote erc-track-minor-mode)) erc-track-minor-mode) (powerline-raw erc-modified-channels-object face1 (quote l))) (powerline-major-mode face1 (quote l)) (powerline-process face1) (powerline-minor-modes face1 (quote l)) (powerline-narrow face1 (quote l)) (powerline-raw   face1) (funcall separator-left face1 face2) (powerline-vc face2 (quote r)) (when (bound-and-true-p nyan-mode) (powerline-raw (list (nyan-create)) face2 (quote l))))) (rhs (list (powerline-raw global-mode-string face2 (quote r)) (funcall separator-right face2 face1) (unless window-system (powerline-raw (char-to-string 57505) face1 (quote l))) (powerline-raw %4l face1 (quote l)) (powerline-raw : face1 (quote l)) (powerline-raw %3c face1 (quote r)) (funcall separator-right face1 face0) (powerline-raw   face0) (powerline-raw %6p face0 (quote r)) (when powerline-display-hud (powerline-hud face0 face2)) (powerline-fill face0 0)))) (concat (powerline-render lhs) (powerline-fill face2 (powerline-width rhs)) (powerline-render rhs)))) |

* Window management

#+BEGIN_SRC emacs-lisp

(setq split-height-threshold nil)
(setq split-width-threshold 160)

#+END_SRC

#+RESULTS:
: 160

* Helm
#+BEGIN_SRC emacs-lisp

  (use-package helm
  :ensure t)

  (define-key helm-map (kbd "TAB") #'helm-execute-persistent-action)
  (define-key helm-map (kbd "<tab>") #'helm-execute-persistent-action)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  (global-set-key (kbd "C-x C-b") 'helm-buffers-list)
  (global-set-key (kbd "M-x") 'helm-M-x)
  (helm-autoresize-mode 1)
  (setq helm-split-window-in-side-p t)
  (helm-mode 1)

  ;; Helm at bottom of the screen
  (add-to-list 'display-buffer-alist
                      `(,(rx bos "*helm" (* not-newline) "*" eos)
                           (display-buffer-in-side-window)
                           (inhibit-same-window . t)
                           (window-height . 0.4)))


#+END_SRC

#+RESULTS:
| \`\*helm.*\*\' | (display-buffer-in-side-window) | (inhibit-same-window . t) | (window-height . 0.4) |

* Flycheck Clang tidy
#+BEGIN_SRC emacs-lisp

  ;; (use-package flycheck-clang-tidy
  ;; :after flycheck
  ;; :hook
  ;; (flycheck-mode . flycheck-clang-tidy-setup))

#+END_SRC

#+RESULTS:
| flycheck-clang-tidy-setup | flycheck-mode-set-explicitly |

